Repository: recomedia/x1-logic-nodes
Catalog: VisuWebNodes/Resources.*.resx
Languages: de

# BinaryInput
source: Binary
de: Binär

# EmptyPlaceholder
source: is empty. Placeholders must at least specify a (previously defined) {<name>} or a valid type letter prefixed with a colon {:<T>}.
de: ist leer. Platzhalter müssen mindestens entweder einen (bereits vorher verwendeten) {<Namen>} oder einen gültigen Typ-Buchstaben mit vorangestelltem Doppelpunkt {:<T>} enthalten.

# EmptyTemplate
source: The format template is empty. Enter a valid C# expression.
de: Die Formatvorlage ist leer. Sie sollte zumindest einen Platzhalter enthalten, der von {} umschlossen ist.

# ExplicitMappingInvalidRange
source: contains a misformed range for a text representation. Ranges consist of optional numbers with .. in between. Numbers must use comma as the decimal separator, and cannot contain group (thousands) separators. Prefix range boundaries with > (for lower boundaries), or < (upper boundaries), to indicate that the respective value itself should be treated as out of the range.
de: enthält eine ungültige Bereichsfestlegung für eine Textdarstellung. Bereiche werden durch zwei optionale Bereichsgrenzen (Zahlenwerte) festgelegt, die durch .. getrennt werden. Die Zahlenwerte müssen ggf. Komma als Dezimaltrennzeichen vor den Nachkommastellen verwenden und dürfen keine Gruppentrennzeichen (Tausendertrennzeichen) enthalten. Den Bereichsgrenzen kann optional > (für untere Bereichsgrenzen) oder < (für obere Bereichsgrenzen) vorangestellt werden, um den Wert selbst aus dem Bereich auszuschließen.

# ExplicitMappingInvalidValue
source: contains a misformed number for a text representation. Numbers use comma as the decimal separator (if needed), and cannot contain group (thousands) separators.
de: enthält einen ungültigen Zahlenwert für eine Textdarstellung. Zahlenwerte müssen ggf. Komma als Dezimaltrennzeichen vor den Nachkommastellen verwenden und dürfen keine Gruppentrennzeichen (Tausendertrennzeichen) enthalten.

# ExplicitMappingInvRngVal
source: contains a misformed range boundary (number) for a text representation. Numbers must use comma as the decimal separator, and cannot contain group (thousands) separators. Prefix range boundaries with > (for lower boundaries), or < (upper boundaries), to indicate that the respective value itself should be treated as out of the range.
de: enthält eine ungültige Bereichsgrenze (Zahlenwert) für eine Textdarstellung. Zahlenwerte müssen ggf. Komma als Dezimaltrennzeichen vor den Nachkommastellen) verwenden und dürfen keine Gruppentrennzeichen (Tausendertrennzeichen) enthalten. Den Bereichsgrenzen kann optional > (für untere Bereichsgrenzen) oder < (für obere Bereichsgrenzen) vorangestellt werden, um den Wert selbst aus dem Bereich auszuschließen.

# IntegerInput
source: Integer
de: Ganzzahl

# MappingNoExplicitValues
source: contains a mix of implicit and explicit values for text representations. This generally not allowable. Integer text representations can either exclusively use implicit values or value ranges, or exclusively use explicit values or value ranges. Floating point numer representations can only use explicit values or value ranges.
de: enthält eine Mischung von expliziten und impliziten Werten für Textdarstellungen. Dies ist generell nicht erlaubt. Textdarstellungen für Ganzzahlen können entweder nur implizite oder nur explizite Werte oder Wertebereiche verwenden. Textdarstellungen für Fließkommazahlen können nur explizite Werte oder Wertebereiche verwenden.

# MappingNoImplicitValues
source: uses implicit values for text representations. Floating point number representations generally can't use implicit values. Integer representations don't support mixing implicit and explicit values.
de: verwendet implizite Werte für Textdarstellungen. Bei Textdarstellungen für Fließkommazahlen ist dies generell nicht erlaubt. Textdarstellungen für Ganzzahlen können implizite und explizite Werte nicht mischen.

# MappingWrongAssignment
source: contains an invalid assignment for a text representation. Valid assignments contain exactly one equals sign (=) between value or range (left hand side) and the text (right hand side).
de: enthält eine ungültige Zuweisung für eine Textdarstellung. Gültige Zuweisungen enthalten genau ein Gleichkeitszeichen (=) zwischen Wert oder Wertebereich (links) und Text (rechts).

# NoPlaceholder
source: The format template contains no placeholders. Enclose placeholders in {}.
de: Die Formatvorlage enthält keine Platzhalter. Platzhalter müssen von {} umschlossen sein.

# NumberInput
source: Number
de: Zahl

source: Output
de: Ausgang

# PlaceholderBinLengthInvalid
source: is misformed. Binary (boolean) placeholders take either no parameters ({:B}), two character parameters ({:Bxy}), or a list of two string parameters ({B|false|true}).
de: ist ungültig. Binär-Platzhalter können ohne Parameter ({:B}), mit zwei Buchstaben als Parameter ({:Bxy}) oder mit einer Liste von zwei Texten als Parameter ({:B|Falsch|Wahr}) verwendet werden.

# PlaceholderIntLengthInvalid
source: is misformed. Integer placeholders ({:I}) support no precision parameter. Optionally, values or value ranges can be specified with text representations (like in [:I|0=null|..<0=negative|>0..=positive}).
de: ist ungültig. Ganzzahl-Platzhalter ({:I}) haben keinen Genauigkeits-Parameter. Optional können Werte oder Wertebereiche angegeben werden, die als Texte dargestellt werden sollen (z. B. [:I|0=Null|..<0=Negativ|>0..=Positiv}).

# PlaceholderMultipleColon
source: is misformed. A placeholder can contain no more than one colon (:), which separates the input name (left hand side) from type and formatting information (right hand side).
de: ist ungültig. Platzhalter können höchstens einen Doppelpunkt (:) enthalten, das den Eingangsnamen (links) von Typ- und Formatierungsinformationen (rechts) trennt.

# PlaceholderNameNotFound
source: is an invalid reference. The input name has not been defined before. A type must be given with the input name upon first use. Type characters must be specified with a prefixed colon.
de: ist eine ungültige Referenz. Der Eingangsname wurde vorher nicht definiert. Für jeden Eingangsnamen muss bei der ersten Verwendung ein Typ festgelegt werden. Typbuchstaben müssen mit vorangestelltem Doppelpunkt angegeben werden.

# PlaceholderNumFormatInvalid
source: is misformed. Number placeholders take either no parameters ({:N}), or a one-digit precision parameter ({N1}) after their type letter. Values or value ranges can optionally be specified with text representations (like in {:N|..<0=underflow|>1000..=overflow}).
de: ist ungültig. Platzhalter für Fließkommazahlen können ohne Parameter (z. B. {:N}) oder mit einer Ziffer (Genauigkeit) als Parameter (z. B. {:F3}) verwendet werden. Zusätzlich sind Werte oder Wertebereiche für Textdarstellungen möglich (z. B. {:F|..<0=zu niedrig|>1000..=zu hoch}).

# PlaceholderReuseWrongType
source: refers to a previously defined input name, but specifies a different type. A reference can only redefine the formatting, but not the type, of the used input.
de: bezieht sich auf einen bereits definierten Eingangsnamen, gibt aber einen anderen Typ an. Eine Referenz kann nur die Formatierung, nicht aber den Typ ihres Eingangs neu festlegen.

# PlaceholderStrLengthInvalid
source: is misformed. The string ({:S}) placeholder does not support any parameters.
de: ist ungültig. Der Text-Platzhalter ({:S}) kann nur ohne Parameter verwendet werden.

# PlaceholderTypeInvalid
source: is an unknown placeholder type. Only the following type characters can be used (as upper or lower case): B → Binary (boolean); I → Integer; F, N, G, P → Floating point number (double) specifying different formats; S → Text (string).
de: enthält einen unbekannten Typ. Nur die folgenden Typbuchstaben sind (als Klein- oder Großbuchstaben) zulässig: B → Binär (boolean); I → Ganzzahl (integer); F, N, G, P → Fließkommazahl (double) mit unterschiedlichen Zahlformatierungen; S → Text (string).

# Template
source: Format Template
de: Formatvorlage

# TooManyBinPlaceholders
source: The format template contains too many binary ({:B}) placeholders.
de: Die Formatvorlage enthält zu viele Binär-Platzhalter ({:B}).

# TooManyIntPlaceholders
source: The format template contains too many integer ({:I}) placeholders.
de: Die Formatvorlage enthält zu viele Ganzzahl-Platzhalter ({:I}).

# TooManyNumPlaceholders
source: The format template contains too many floating point number (({:F}, {:N}, {:G} and/or {:P}) placeholders.
de: Die Formatvorlage enthält zu viele Fließkommazahl-Platzhalter ({:F}, {:N}, {:G} und/oder {:P}).

# TooManyPlaceholders
source: The format template contains too many placeholders.
de: Die Formatvorlage enthält zu viele Platzhalter.

# TooManyStrPlaceholders
source: The format template contains too many string ({:S}) placeholders.
de: Die Formatvorlage enthält zu viele Text-Platzhalter ({:S}).

# PlaceholderNameInvalid
source: contains an invalid input name. Valid names start with a letter and can continue with letters, digits, blanks (not at the end) or most special characters. Colons (:) or curly brackets ({ and }) cannot be used.
de: enthält einen ungültigen Eingangsnamen. Gültige Namen beginnen mit einem Buchstaben. Weiter sind auch Ziffern, Leerzeichen (nicht am Ende) und viele Sonderzeichen erlaubt. Doppelpunkt (:) oder geschweifte Klammrern ({ und }) können nicht verwendet werden.

# ExplicitMappingInvertedRange
source: contains a text representation with a value range where the upper bound is no larger than the lower bound.
de: enthält eine Textdarstellung mit einem Wertebereich, bei dem die obere Grenze nicht größer ist als die untere.

# PlaceholderBinInvalidAssign
source: contains a text representation with an explicit value assignment. This is generally not supported for binary values. Use implicit values for text representations in {:B} placeholders.
de: enthält eine Textdarstellung mit expliziter Wertzuweisung. Dies ist bei Binärwerten generell nicht erlaubt. {:B}-Platzhalter verwenden nur implizite Werte für Textdarstellungen.

# PlaceholderBinSameText
source: has the same text representation for false and true values. Text representations must be different (and only one of them can be empty).
de: hat die gleiche Textdarstellung für die Werte falsch und wahr. Die Textdarstellungen müssen verschieden sein (und nur eine davon darf leer sein).

# MappingEmptyImplicitValue
source: contains an empty text representation. This is only allowed when a value is explicitly given, but not for implicit values.
de: enthält eine leere Textdarstellung. Dies ist nur erlaubt, wenn der Wert explizit angegeben ist, nicht für implizite Werte.

# HasDefaultName
source: uses a default name, which is not allowable in this context. Specify an explicit name before the :.
de: benutzt einen automatisch vergebenen Namen, was in diesem Baustein nicht erlaubt ist. Vor dem Doppelpunkt (:) muss ein Name angegeben werden.

# HasFormatOrMappings
source: contains a format specification or text mappings, which is not allowable in this context. Specify only a valid type letter.
de: enthält eine unerlaubte Formatangabe und/oder Textdarstellungen. Nur ein gültiger Typbuchstabe sollte angegeben werden.

# HasUnusableName
source: has a name that uses special characters, which is not allowable in this context. Specify a name starting with a letter and using only letters, digits, and _.
de: verwendet im Namen unerlaubte Sonderzeichen. Der Name muss mit einem Buchstaben anfangen und darf nur Buchstaben, Ziffern (0..9) und Unterstriche (_) enthalten.

source: Expression
de: Formel

# ExpressionCount
source: Number of Outputs and Expressions
de: Anzahl der Ausgänge und Formeln

# OutType
source: Output Type
de: Typ des Ausgangs

source: Runtime Error
de: Laufzeitfehler

# TemplateCount
source: Number of Outputs and Templates
de: Anzahl der Ausgänge und Formatvorlagen

# HasOutOfRangeRef
source: contains a reference to an output that either doesn't exist or cannot be used here. Current output values (_out..._) can only be used from expressions with lower numbers than the referencing expression.
de: enthält eine Referenz auf einen Ausgang der entweder nicht existiert oder an dieser Stelle nicht verwendet werden kann. Aktuelle Ausgangswerte (_out.._) können nur aus Formeln mit kleineren Nummern als der referenzierenden Formel verwendet werden.

# HasAssignment
source: contains an assignment. This is generally not allowable in expressions.
de: enthält eine Zuweisung. Dies ist in Formeln generell nicht zulässig.

# NotFound
source: was not found in input text.
de: wurde im Eingabetext nicht gefunden.

source: Path
de: Pfad

# OutputCount
source: Number of Paths and Outputs
de: Anzahl der Pfade und Ausgänge

# FirstAsNumber
source: First matching item as number
de: Erster Treffer als Zahl

# FirstAsNumberParam
source: Scaling factor
de: Skalierungsfaktor

# FirstAsText
source: First matching item as text
de: Erster Treffer als Text

# FirstAsTextParam
source: Text prefix
de: Text-Vorsatz

# InvalidScaling
source: is not a valid scaling factor. Scaling factors must use full stop (.) or comma (,) as the decimal separator and cannot use group (thousands) separators.
de: ist kein gültiger Skalierungsfaktor. Als Dezimaltrennzeichen muss Komma (,) oder Punkt (.) verwendet werden. Gruppentrennzeichen (Tausendertrennzeichen) sind nicht zulässig.

# MultiAddNumbers
source: Sum of matching items as numbers
de: Alle Treffer als summierte Zahl

# MultiMinNumber
source: Minimum number of matching items
de: Minimum aller Treffer als Zahl

# MultiMaxNumber
source: Maximum number of matching items
de: Maximum aller Treffer als Zahl

# MultiAddNumbersParam
source: Scaling factor
de: Skalierungsfaktor

# MultiMinNumberParam
source: Scaling factor
de: Skalierungsfaktor

# MultiMaxNumberParam
source: Scaling factor
de: Skalierungsfaktor

# MultiConcatTexts
source: Concatenate matching items as text
de: Alle Treffer als verketteter Text

# MultiConcatTextsParam
source: Text separator
de: Text-Trenner

# NoXmlDouble
source: cannot converted to a number.
de: kann nicht in eine Zahl umgewandelt werden.

# SelectOperation
source: Type of selection
de: Art der Pfadauswahl

# SelectCode
source: Input coding
de: Eingangskodierung

# SeparatorDecimal
source: Decimal Separator
de: Dezimal-Trennzeichen

# SeparatorDecimalTooLong
source: The decimal separator cannot be longer than one character.
de: Das Dezimaltrennzeichen darf maximal ein Zeichen haben.

# SeparatorDecimalTooShort
source: The decimal separator cannot be empty.
de: Das Dezimaltrennzeichen darf nicht leer sein.

# SeparatorGroup
source: Group (Thousands) Separator
de: Gruppen- (Tausender-) Trennzeichen

# SeparatorGroupTooLong
source: The group separator cannot be longer than one character.
de: Das Gruppentrennzeichen darf maximal ein Zeichen haben.

# SeparatorsIdentical
source: Group and decimal separator cannot be the same.
de: Gruppen- und Dezimaltrennzeichen dürfen nicht gleich sein.

# MappingNoImplicitTextValues
source: uses implicit values for text replacements. String placeholders generally can't use implicit replacement values. Use assignments with an equals sign (=) instead.
de: verwendet implizite Werte für Textersetzungen. Text-Platzhalter erlauben generell keine impliziten Ersetzungen, sondern nur Zuweisungen mit einem =.

# MappingNoOriginalTextValue
source: contains an empty orignal text for a text replacement. The original text must be one character or longer.
de: enthält einen leeren Orignaltext für eine Textersetzung. Der Originaltext muss mindestens ein Zeichen lang sein.

# MappingWrongTextAssignment
source: contains an invalid assignment for a text replacement. Valid assignments contain exactly one equals sign (=) between the original text (left hand side) and the replacement text (right hand side).
de: enthält eine ungültige Zuweisung für eine Textersetzung. Gültige Zuweisungen enthalten genau ein Gleichkeitszeichen (=) zwischen Originaltext (links) und Ersetzungstext (rechts).
